###### Merge Dataframes
Pandas merge function provides functionality similar to database joins. You can merge two data frames using a column column. One can perform left, right, outer or inner joins on these dataframes. This tutorial also covers indicator and suffixes flags in pandas.merge function.

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

###### Scenario
We want to join both df's into one df that contains both temp and humidity. We are going to use the merge function to do this...

In [4]:
df3 = pd.merge(df1, df2, on="city")
df3
# We invoke the merge function which is a df function
# We list the df's that we want to merge
# Lastly, the on arguments asks what column do we want to use to merge the df's together on

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

Presumably this can only be done on df's that share a common column but when you have that you get so much better results. Here we do not have two sets of indices, no repeated data, no problems with the index. This works very well indeed.

###### Scenario
What if you have different cities in the two df's where some are present in both but not all

In [5]:
df4 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,32],
})
df4

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [6]:
df5 = pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity": [65,68,71],
})
df5

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [7]:
df6 = pd.merge(df4, df5, on="city")
df6

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

So now when we perform the same merge operation we only have two cities...the two cities that are common to the two df's. Anything that is not present in all df's gets dropped!

The way to get arounbd this comes from set theory and in particular the idea of the outer join...

In [8]:
df7 = pd.merge(df4, df5, on="city", how = 'outer')
df7

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      71.0

We get all the cities appearing but where there is no data for a column we just get an NaN...which I guess is fair enough. We have still avoided the issues with the duplicated index values etc.

The inner join is the default here so does not need to be specified. We could also specify left and right here too. Left & right is decided by which df appears first in the merge operation, we did df4(left) and then df5(right). So when I specify how = left, I will get the missing elements from the left df ie df4 and vice versa.

For more information, visit - https://pandas.pydata.org/pandas-docs/stable/merging.html

In [11]:
df7 = pd.merge(df4, df5, on="city", how = 'outer', indicator = True)
df7

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

The indicator argument, which is False by default, when turned on will tell you from which df the data came. It creates its own little column called _merge and let's you know the required info.

###### Suffixes

In [13]:
df8 = df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df8

        city  humidity  temperature
0   new york        65           21
1    chicago        68           14
2    orlando        71           35
3  baltimore        75           38

In [14]:
df9 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df9

        city  humidity  temperature
0    chicago        65           21
1   new york        68           14
2  san diego        71           35

In [16]:
df10 = pd.merge(df8, df9, on="city")
df10

       city  humidity_x  temperature_x  humidity_y  temperature_y
0  new york          65             21          68             14
1   chicago          68             14          65             21

When we merge these two df's, we notice that we have an _x & _y appened to the column name. This is to distinguish between the two columns that were appended from the two individual df's during the merge.

You can actually specify what suffixes are to be used...

In [17]:
df10 = pd.merge(df8, df9, on="city", suffixes = ('_left', '_right'))
df10

,city,humidity_left,temperature_left,humidity_right,temperature_right
0,new york,65,21,68,14
1,chicago,68,14,65,21